; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v2 ?v5)
             (pred_7 ?v13 ?v6)
             (pred_2 ?v2 ?v6)
             (pred_3 ?v12 ?v2 )
	     (pred_10 ?v2)
             (pred_12 ?v4)
             (pred_5 ?v13)
             (pred_4 ?v6)
             (pred_1 ?v2)
             (pred_9 ?v13)
             (pred_6 ?v2)
             (pred_8 ))



(:action op_1
:parameters (?v7 ?v1 ?v3 ?v9)
:precondition (and (pred_12 ?v7) (pred_12 ?v1) (pred_5 ?v3) (pred_4 ?v9)
          (pred_11 ?v7 ?v1) (pred_7 ?v3 ?v9)
                   (pred_2 ?v1 ?v9) (pred_10 ?v7) 
                   (pred_1 ?v1) (pred_9 ?v3))
:effect (and  (pred_6 ?v1) (not (pred_1 ?v1))))


(:action op_2
:parameters (?v7 ?v8)
:precondition (and (pred_12 ?v7) (pred_12 ?v8)
               (pred_10 ?v7) (pred_11 ?v7 ?v8) (pred_6 ?v8))
:effect (and (pred_10 ?v8) (not (pred_10 ?v7))))

(:action op_5
:parameters (?v7 ?v3)
:precondition (and (pred_12 ?v7) (pred_5 ?v3) 
                  (pred_10 ?v7) (pred_3 ?v3 ?v7) (pred_8 ))
:effect (and (pred_9 ?v3)
   (not (pred_3 ?v3 ?v7)) (not (pred_8 ))))


(:action op_4
:parameters (?v7 ?v10 ?v11)
:precondition (and (pred_12 ?v7) (pred_5 ?v10) (pred_5 ?v11)
                  (pred_10 ?v7) (pred_9 ?v11) (pred_3 ?v10 ?v7))
:effect (and (pred_9 ?v10) (pred_3 ?v11 ?v7)
        (not (pred_9 ?v11)) (not (pred_3 ?v10 ?v7))))

(:action op_3
:parameters (?v7 ?v3)
:precondition (and (pred_12 ?v7) (pred_5 ?v3) 
                  (pred_10 ?v7) (pred_9 ?v3))
:effect (and (pred_8 ) (pred_3 ?v3 ?v7) (not (pred_9 ?v3)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_01 obj_29 obj_31 obj_28 obj_09 obj_07 obj_10 obj_22 obj_32 obj_12 obj_04 obj_05 obj_13 obj_15 obj_20 obj_23 obj_03 obj_11 obj_24 obj_14 obj_25 obj_16 obj_02 obj_08 obj_27
    obj_30 obj_26 obj_06
    obj_21 obj_18 obj_19 obj_17
    )

    (:init
       (pred_8)

       (pred_12 obj_01)
       (pred_12 obj_29)
       (pred_12 obj_31)
       (pred_12 obj_28)
       (pred_12 obj_09)
       (pred_12 obj_07)
       (pred_12 obj_10)
       (pred_12 obj_22)
       (pred_12 obj_32)
       (pred_12 obj_12)
       (pred_12 obj_04)
       (pred_12 obj_05)
       (pred_12 obj_13)
       (pred_12 obj_15)
       (pred_12 obj_20)
       (pred_12 obj_23)
       (pred_12 obj_03)
       (pred_12 obj_11)
       (pred_12 obj_24)
       (pred_12 obj_14)
       (pred_12 obj_25)
       (pred_12 obj_16)
       (pred_12 obj_02)
       (pred_12 obj_08)
       (pred_12 obj_27)
       (pred_4 obj_30)
       (pred_4 obj_26)
       (pred_4 obj_06)
       (pred_5 obj_21)
       (pred_5 obj_18)
       (pred_5 obj_19)
       (pred_5 obj_17)

       (pred_11 obj_01 obj_07)
       (pred_11 obj_01 obj_29)
       (pred_11 obj_29 obj_10)
       (pred_11 obj_29 obj_31)
       (pred_11 obj_29 obj_01)
       (pred_11 obj_31 obj_22)
       (pred_11 obj_31 obj_28)
       (pred_11 obj_31 obj_29)
       (pred_11 obj_28 obj_32)
       (pred_11 obj_28 obj_09)
       (pred_11 obj_28 obj_31)
       (pred_11 obj_09 obj_12)
       (pred_11 obj_09 obj_28)
       (pred_11 obj_07 obj_04)
       (pred_11 obj_07 obj_10)
       (pred_11 obj_07 obj_01)
       (pred_11 obj_10 obj_05)
       (pred_11 obj_10 obj_22)
       (pred_11 obj_10 obj_29)
       (pred_11 obj_10 obj_07)
       (pred_11 obj_22 obj_13)
       (pred_11 obj_22 obj_32)
       (pred_11 obj_22 obj_31)
       (pred_11 obj_22 obj_10)
       (pred_11 obj_32 obj_15)
       (pred_11 obj_32 obj_12)
       (pred_11 obj_32 obj_28)
       (pred_11 obj_32 obj_22)
       (pred_11 obj_12 obj_20)
       (pred_11 obj_12 obj_09)
       (pred_11 obj_12 obj_32)
       (pred_11 obj_04 obj_23)
       (pred_11 obj_04 obj_05)
       (pred_11 obj_04 obj_07)
       (pred_11 obj_05 obj_03)
       (pred_11 obj_05 obj_13)
       (pred_11 obj_05 obj_10)
       (pred_11 obj_05 obj_04)
       (pred_11 obj_13 obj_11)
       (pred_11 obj_13 obj_15)
       (pred_11 obj_13 obj_22)
       (pred_11 obj_13 obj_05)
       (pred_11 obj_15 obj_24)
       (pred_11 obj_15 obj_20)
       (pred_11 obj_15 obj_32)
       (pred_11 obj_15 obj_13)
       (pred_11 obj_20 obj_14)
       (pred_11 obj_20 obj_12)
       (pred_11 obj_20 obj_15)
       (pred_11 obj_23 obj_25)
       (pred_11 obj_23 obj_03)
       (pred_11 obj_23 obj_04)
       (pred_11 obj_03 obj_16)
       (pred_11 obj_03 obj_11)
       (pred_11 obj_03 obj_05)
       (pred_11 obj_03 obj_23)
       (pred_11 obj_11 obj_02)
       (pred_11 obj_11 obj_24)
       (pred_11 obj_11 obj_13)
       (pred_11 obj_11 obj_03)
       (pred_11 obj_24 obj_08)
       (pred_11 obj_24 obj_14)
       (pred_11 obj_24 obj_15)
       (pred_11 obj_24 obj_11)
       (pred_11 obj_14 obj_27)
       (pred_11 obj_14 obj_20)
       (pred_11 obj_14 obj_24)
       (pred_11 obj_25 obj_16)
       (pred_11 obj_25 obj_23)
       (pred_11 obj_16 obj_02)
       (pred_11 obj_16 obj_03)
       (pred_11 obj_16 obj_25)
       (pred_11 obj_02 obj_08)
       (pred_11 obj_02 obj_11)
       (pred_11 obj_02 obj_16)
       (pred_11 obj_08 obj_27)
       (pred_11 obj_08 obj_24)
       (pred_11 obj_08 obj_02)
       (pred_11 obj_27 obj_14)
       (pred_11 obj_27 obj_08)
       (pred_1 obj_02)
       (pred_1 obj_22)
       (pred_1 obj_15)
       (pred_1 obj_13)
       (pred_2  obj_02 obj_30)
       (pred_2  obj_22 obj_26)
       (pred_2  obj_15 obj_06)
       (pred_2  obj_13 obj_26)
       (pred_6 obj_01)
       (pred_6 obj_29)
       (pred_6 obj_31)
       (pred_6 obj_28)
       (pred_6 obj_09)
       (pred_6 obj_07)
       (pred_6 obj_10)
       (pred_6 obj_32)
       (pred_6 obj_12)
       (pred_6 obj_04)
       (pred_6 obj_05)
       (pred_6 obj_20)
       (pred_6 obj_23)
       (pred_6 obj_03)
       (pred_6 obj_11)
       (pred_6 obj_24)
       (pred_6 obj_14)
       (pred_6 obj_25)
       (pred_6 obj_16)
       (pred_6 obj_08)
       (pred_6 obj_27)

       (pred_7  obj_21 obj_30)
       (pred_7  obj_18 obj_26)
       (pred_7  obj_19 obj_06)
       (pred_7  obj_17 obj_30)
       (pred_3 obj_21 obj_11)
       (pred_3 obj_18 obj_20)
       (pred_3 obj_19 obj_23)
       (pred_3 obj_17 obj_12)
       (pred_10 obj_29)
    )

    (:goal (and
       (pred_3 obj_21 obj_02)
    ))
(:constraints
  (always (not (pred_10 obj_03)))
)
)

; plan
1. (op_2 obj_29 obj_31)
   deleted: (pred_10 obj_29)
   added: (pred_10 obj_31)
   goals met: 0 of 1
2. (op_2 obj_31 obj_28)
   deleted: (pred_10 obj_31)
   added: (pred_10 obj_28)
   goals met: 0 of 1
3. (op_2 obj_28 obj_09)
   deleted: (pred_10 obj_28)
   added: (pred_10 obj_09)
   goals met: 0 of 1
4. (op_2 obj_09 obj_12)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_12)
   goals met: 0 of 1
5. (op_5 obj_12 obj_17)
   deleted: (pred_3 obj_17 obj_12) (pred_8)
   added: (pred_9 obj_17)
   goals met: 0 of 1
6. (op_2 obj_12 obj_20)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_20)
   goals met: 0 of 1
7. (op_2 obj_20 obj_14)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_14)
   goals met: 0 of 1
8. (op_2 obj_14 obj_24)
   deleted: (pred_10 obj_14)
   added: (pred_10 obj_24)
   goals met: 0 of 1
9. (op_2 obj_24 obj_11)
   deleted: (pred_10 obj_24)
   added: (pred_10 obj_11)
   goals met: 0 of 1
10. (op_4 obj_11 obj_21 obj_17)
   deleted: (pred_9 obj_17) (pred_3 obj_21 obj_11)
   added: (pred_9 obj_21) (pred_3 obj_17 obj_11)
   goals met: 0 of 1
11. (op_1 obj_11 obj_02 obj_21 obj_30)
   deleted: (pred_1 obj_02)
   added: (pred_6 obj_02)
   goals met: 0 of 1
12. (op_2 obj_11 obj_02)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_02)
   goals met: 0 of 1
13. (op_3 obj_02 obj_21)
   deleted: (pred_9 obj_21)
   added: (pred_8) (pred_3 obj_21 obj_02)
   goals met: 1 of 1
